//////////////////////////////////////////////////////////////////////////////////
//本程序不只供学习使用，未经作者许可，可随便用于其它任何用途
//校赛B题用
//2019年华北理工大学电子设计竞赛
//
//	工 程 名   : 平衡车自平衡程序
//	版 本 号   : 没有
//	作    者   : 18电二吴少兵
//	生成日期   : 2019-0318
//	最近修改   : 2019/4/23
//	功能描述   : 自平衡
//
//							说明:
//							-----------------------------------------------------
//							串口			RX：PA9(USART1_TX)
//												TX：PA10(USART1_RX)
//							-----------------------------------------------------
//							蓝牙			RX：PB10(USART3_TX)
//												TX：PB11(USART3_RX)
//							-----------------------------------------------------
//							下载			SDWIO：PA13
//												SWDCLK：PA14
//							-----------------------------------------------------
//							按键			KEY1：PA2
//												KEY2：PB4
//							-----------------------------------------------------
//							指示灯		LED1：PA15
//												LED2：PB3
//							-----------------------------------------------------
//							编码器		左：PA0,PA1
//												右：PB6,PB7
//							-----------------------------------------------------
//							超声波		TRIG：PB1
//												ECHO：PB0
//							-----------------------------------------------------
//							蜂鸣器		BEEP：PA12
//							-----------------------------------------------------
//							陀螺仪		IIC SCL：PB8
//												IIC SDA：PB9
//												IN：PB5
//							-----------------------------------------------------
//							显示屏1		IIC SCL：PA5
//												IIC SDA：PA6
//							-----------------------------------------------------
//							显示屏2		IIC SCL：PA7
//												IIC SDA：PB2
//							-----------------------------------------------------
//							电机驱动	使能：VCC
//												PWMA：PA8
//												PWMB：PA11
//												AIN1：PB14
//												AIN2：PB15
//												BIN1：PB13
//												BIN2：PB12
//							-----------------------------------------------------
//							红外光电对管RED_LED0：PA4
//													RED_LED1：PA3
//							-----------------------------------------------------
//							汇总				PA：0 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15
//													PB：0 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15
//
//STM32F10X_MD,USE_STDPERIPH_DRIVER
//////////////////////////////////////////////////////////////////////////////////
//算法部分
//作者：吴少兵
//说明：以下内容纯属个人见解，仅供参考

//本程序使用PID算法对系统进行控制
//采样时间10ms
//每采集一次即做一次控制
//其中积分部分采用累加方式代替，一阶微分由一阶差分替换
//用到的离散PID公式：	pwm=Kp*e(k)+Ki*∑e(k)+Kd[e（k）-e(k-1)]
//偏差=本次测量值-设定值
//e(k)为本次偏差 
//e(k-1)为上一次的偏差  
//∑e(k)为e(k)以及之前的偏差的累积和;其中k为1,2,...,k;
//Kp为本次偏差比例系数
//Ki为偏差积分系数
//Kd为本次与上次偏差微分系数
//pwm为输出
//P为主要控制系数，增大可提高系统响应速度，震荡随之增加
//I做辅助，用于消除P较小时系统产生的静差
//D做辅助，用于抑制震荡
/********************************************************************************************************************/
//陀螺仪采样解算部分
//陀螺仪安装：以x轴正方向为行进方向
//倾角测量值由MPU6050集成线加速度计(三轴加速度计)解算得到的角度值与其角运动传感器(陀螺仪)积分得到的数据融合而成
//本程序采用卡尔曼滤波方式对二者输出的倾角值进行融合
//用到的解算公式(对于线加速度计)：Accel_Y=atan2(Accel_X,Accel_Z)*180/PI
//Accel_Y为解算后得到的倾角
//Accel_X为MPU6050 X 轴方向的加速度
//Accel_Z为MPU6050 Z 轴方向的加速度
//atan2(y,x)表示X-Y平面上所对应的(x,y)坐标角度，返回值为原点至指定点的方位角，即与X轴的夹角，单位为rad
//*180/PI：单位转换(rad->°)
//用到的解算公式(对于角运动传感器，即陀螺仪)：Gyro_Y=Gyro_Y/16.4 Gyro_Y-=Gyro_Y*0.005
//Gyro_Y为角度值
//Gyro_Y=Gyro_Y/16.4，量程为±2000°/s时，陀螺仪量程转换系数为16.4
//Gyro_Y-=Gyro_Y*0.005，陀螺仪角度积分，陀螺仪5ms读取一次，将单位转换为s，计算角度需*0.005
/*********************************************************************************************************************/
//直立PD控制部分
//用到的控制公式：a=Kp*θ+Kd*θ'
//a为加速度输出，即作为直立部分PWM输出量
//Kp,Kd为系数
//θ为角度(由于目标倾角为0，故θ即为角度偏差)，在此处为上述已进行滤波的平衡倾角
//θ'为角度(角度偏差)变化率，即角速度，在此处为角运动传感器(陀螺仪)5ms内输出的角度变化值，作为角速度使用
//其中Kp*θ作为回复力，Kd*θ'作为阻尼力
/*********************************************************************************************************************/
//速度PI控制部分
//由于编码器存在噪声，为防止噪声放大并消除系统静差，故速度控制使用PI控制
//a=Kp*(θ-a')+Kd*θ'			(1)
//a'=Kp'*e(k)+Ki'*∑e(k)	(2)
//式(1)为直立控制算法，式(2)为速度控制算法
//e(k)为速度控制偏差
//∑e(k)为速度控制偏差积分
/*********************************************************************************************************************/
//串级PID控制
//本程序采用串级PID进行控制
//将(2)式代入(1)式得 a=Kp*θ+Kd*θ'-Kp[Kp'*e(k)+Ki'∑e(k)]
//即速度控制输出作为直立控制输入，直立控制输出作为整个系统输出
/*********************************************************************************************************************/
//转向P控制
//用到的控制公式：Turn=Kp*Gyro_Z
//Gyro_Z为Z轴角速度
//Turn即为PWM输出

//文件：程序算法说明
//作者：18电二吴少兵
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#include "sys.h"

/*************************************************全局变量定义********************************************************/
u8 Flag_Qian,Flag_Hou,Flag_Left,Flag_Right,Flag_sudu=1; 					//蓝牙遥控变量 前后左右 速度2分频
u8 Flag_Stop=0,Flag_Show=0;                 											//停止标志位:默认停止 显示上传选择位:默认蓝牙(0)
int Encoder_Left,Encoder_Right;             											//左右编码器脉冲计数(速度)
int Moto1,Moto2;                            											//电机PWM变量
int Temperature;                            											//温度
float Angle_Balance,Gyro_Balance,Gyro_Turn,Acceleration_Z; 				//解算并滤波后的 平衡倾角(Y轴旋转角) 角速度(Y轴旋转角速度) 转向角速度(Z轴旋转角速度) Z轴线加速度
float Show_Data_Mb;                         											//全局显示变量，用于显示需要查看的数据
u32 Distance;                               											//超声波解算距离变量
u8 delay_50,delay_flag,Bi_zhang=0,PID_Send,Flash_Send;  					//延时避障调参等变量: 50ms大循环标志位 等待中断标志位 避障模式选择位 发送PID标志位 写入FLASH标志位
float Balance_Kp=300,Balance_Kd=1,Velocity_Kp=-80,Velocity_Ki=-0.4;	//PID参数 直立PD参数 速度PI参数
u16 PID_Parameter[10],Flash_Parameter[10];  											//Flash相关数组

/*************************************************初始化各外设********************************************************/
int main(void)
  {
		NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);		//初始化中断分组 中断优先级分组为2
		JTAG_Set(JTAG_SWD_DISABLE);     									//初始化下载接口 关闭JTAG接口解除IO口占用
		JTAG_Set(SWD_ENABLE);           									//初始化下载接口 打开SWD接口用于下载烧录
		delay_init();	    	            									//初始化延时函数
//		uart_init(128000);	            									//初始化串口1 波特率128000
//		uart3_init(38400);               									//初始化串口3 波特率38400
//		LED_Init();                     									//初始化 LED
//	  KEY_Init();                     									//初始化独立按键
//		BEEP_Init();																			//初始化蜂鸣器
//    MY_PWM_Init(7199,0);   														//初始化PWM 10KHZ
    Encoder_Init_TIM2();            									//初始化编码器接口1
//    Encoder_Init_TIM4();            									//初始化编码器接口2
//    IIC_Init();                     									//初始化陀螺仪IIC接口
//    MPU6050_initialize();           									//初始化陀螺仪
//		DMP_Init();																				//初始化DMP
//    OLED_Init();                    									//初始化OLED(IIC)接口 初始化OLED显示器配置
//		INFRARED_Init();																	//初始化红外光电对管
//		TIM3_Cap_Init(0XFFFF,72-1);	    									//初始化超声波
//	  MY_EXTI_Init();        														//初始化外部中断

/***************************************************主循环********************************************************/
    while(1)
	  {			
		  Encoder_Left = Read_Encoder(2);
//			oled1_show();    		//打开显示屏1
//			oled2_show();				//打开显示屏2
//			if(Flash_Send==1)  	//写入PID参数到Flash,由app控制该指令
//			{
//      Flash_Write();			//flash写数据
//			Flash_Send=0;				//清除写数据标志位
//			}
//		  if(Flag_Show==0)   	//使用MiniBalance APP和OLED显示屏
//			{
////			APP_Show();					//打开手机端数据发送

//			}
//			else                //使用计算机上位机 上位机使用的时候需要严格的时序，故此时关闭app监控部分和OLED显示屏
//			{
//			DataScope();     		//开启计算机上位机
//			}
//			delay_flag=1;				//打开等待中断标志位
//			delay_50=0;					//50ms定时大循环标志位初始置零，
//			while(delay_flag);	//通过MPU6050的INT中断实现的50ms精准延时
	  }
}

